# x1 = 17 / 2 * 3 + 2
# x2 = (17 / 2) * 3 + 2
# if x1 == x2:
#    print('Выражения равны')
# else:
#     print('Выражения не равны')

# x1 = 2 + 17 / 2 * 3
# x2 = 2 + (17 / 2) * 3
# if x1 == x2:
#   print('Выражения равны')
# else:
#      print('Выражения не равны')

# x1 = 19 % 4 + 15 / 2 * 3
# x2 = (19 % 4) + (15 / 2 * 3)
# if x1 == x2:
#     print('Выражения равны')
# else:
#     print('Выражения не равны')

# x1 = (15 +6) - 10 * 4
# x2 = (15 +6) - (10 * 4)
# if x1 == x2:
#     print('Выражения равны')
# else:
#     print('Выражения не равны')

x1 = 17 / 2 % 2 * 3 ** 3
x2 = (17 / 2 % 2) * (3 ** 3)
if x1 == x2:
    print('Выражения равны')
else:
    print('Выражения не равны')